x = [3,2,4,2,1,5,8,5,7,6,9,7,5,2]

c = dict()
#   之後 c[0] 放 0 出現的次數
#        c[?] 放 ? 出現的次數

for a in x:  #處理x中的每一個數字
    #計算a出現的次數
    if a in c:
        c[a] = c[a]+1
    else:
        c[a] = 1

# print('0出現',c[0],'次')
# print('1出現',c[1],'次')
# print('2出現',c[2],'次')

# c = {3: 1, 2: 3, 4: 1, 1: 1, 5: 3, 8: 1, 7: 2, 6: 1, 9: 1}
# for k in sorted(c):
#    print(k,' ',c[k],'次 ','X'*c[k])

# c.items = dict_items([(3, 1), (2, 3), (4, 1), (1, 1), (5, 3), (8, 1), (7, 2), (6, 1), (9, 1)])
for k,v in sorted(c.items()):
    print(k,' ',v,'次 ','X'*v)

